CORRIDOR_POINTS = [
    {"id": "pishchanka", "names": ["піщанка", "піщанку", "піщанці"], "level": 1},
    {"id": "vendychany", "names": ["вендичани", "вендичанах", "вендичан"], "level": 1},
    {"id": "nova_ushytsia", "names": ["нова ушиця", "нову ушицю", "новій ушиці", "н. ушиця", "н.ушиця", "ушиця", "ушицю"], "level": 1},
    {"id": "stara_ushytsia", "names": ["стара ушиця", "стару ушицю", "старій ушиці"], "level": 1},
    {"id": "dunaivtsi", "names": ["дунаївці", "дунаївцях", "дунаївців"], "level": 1},
    {"id": "tomashpil", "names": ["томашпіль", "томашполі", "томашполя"], "level": 1},
    
    {"id": "kamianets_podilskyi", "names": ["камʼянець-подільський", "кам'янець-подільський", "камянець", "камʼянець", "кам'янці", "камʼянці", "камʼянця", "кам'янця"], "level": 2},
    {"id": "skala_podilska", "names": ["скала-подільська", "скалу-подільську", "скалі-подільській", "скала"], "level": 2},
    {"id": "tovste", "names": ["товсте", "товстому", "товстого"], "level": 2},
    {"id": "borshchiv", "names": ["борщів", "борщеві", "борщєві", "борщова", "борщева"], "level": 2},
    
    {"id": "chernelytsia", "names": ["чернелиця", "чернелицю", "чернелиці", "чернелицею"], "level": 3},
    {"id": "tlumach", "names": ["тлумач", "тлумачі", "тлумачем", "тлумачу", "тлумача"], "level": 3},
    {"id": "tysmenytsia", "names": ["тисмениця", "тисменицю", "тисмениці"], "level": 3},
    {"id": "khryplyn", "names": ["хриплин", "хриплині", "хриплину"], "level": 3}
]

ETA_TABLE = {
    # id: (min_minutes, max_minutes) — розраховано для v=400–480 км/год
    "pishchanka": (32, 40),
    "vendychany": (27, 34),
    "nova_ushytsia": (23, 30),
    "stara_ushytsia": (21, 27),
    "dunaivtsi": (19, 25),
    "tomashpil": (35, 43),
    "kamianets_podilskyi": (16, 22),
    "skala_podilska": (12, 17),
    "borshchiv": (11, 16),
    "tovste": (8, 13),
    "chernelytsia": (5, 9),
    "tlumach": (3, 6),
    "tysmenytsia": (0, 3),
    "khryplyn": (0, 2),
}


TARGET_KEYWORDS = [
    "реактивна герань", "реактивні герані",
    "реактивний шахед", "реактивні шахеди",
    "реактивний бпла", "реактивні бпла",
    "шахед-238", "геран-3", "реактив", "джет"
]

CANCEL_KEYWORDS = [
    "вибух",
    "збит",
    "локаційно втрачен",
    "дорозвідка",
    "відбій",
    "на рівне",
    "на рівненщину",
    "на волинь",
    "на житомир",
    "на житомирщину",
    "відбій на заході",
]
